import requests
from telebot import types
import telebot
from time import sleep
import random
from telebot.types import InlineKeyboardButton as btn
from telebot.types import InlineKeyboardMarkup as km
token = ("1990152924:AAFoJyi6-oql0ldybgUeJUi5sCpkyhX2evI")
bot = telebot.TeleBot(token)

iea = [
"﴿مَنْ عَمِلَ مِنكُمْ سُوٓءًۢا بِجَهَالَةٍۢ ثُمَّ تَابَ مِنۢ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَّحِيمٌ﴾.",
"اللهم إرحم قبوراً ضمت في جوفها من نحب، وأجعلها برداً وسلاماً يا الله .",
"﴿ وَذَا النّونِ إِذ ذَهَبَ مُغاضِبًا ﴾",
"﴿رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي﴾",
"‏صلّو عَلى من بكَى شوقاً لرؤيتنِا ، ﷺ",
"{ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ}",
"‏اسقِ طيراً، و أطعِم هِراً، وتصدق  ‏على عاملاً أو مسكيناً، وساعد شيخاً كبيراً،  ‏فلا تدري أي عمل فيهم ينجيك من النار  ‏ويدخلك الجنة .",
"اللهم اغفرلي واغفر لجميع المسلمين يا الله",
"استغفر الله العظيم من كل ذنب عظيم",
"وأشفِ أنت الشافي  . .",
"‏إذا اشتدَّ حرّ صدوركم = فأبرِدوا بالقرآن.",
"اللهمَّ يا مقلب القلوب ثَبِّتْ قلوبَنا على دينِكَ .",
"ضاقت بيّ الارض يالله , أسعها فإني بحاجتك وليسَ لي غيرك .",
"إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا 🤍.",
"﴿ وَٱصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا ۖ وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ ﴾.",
"((   فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ   ))",
"‏وَاسْتَغْفِرِ اللَّهَ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
"(فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا)",
"﴿ وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ ﴾",
"صلّوا على نبيّنا محمد ﷺ .",
"أستغفِرُ الله العظيم وأتوبُ إليه ..",
"باللهِ لا بالنَّاسِ تُقْضَى الحَوَائِجُ ❤️",
"‏﴿أَيْنَمَا تَكُونُوا يُدْرِككُّمُ الْمَوْتُ وَلَوْ كُنتُمْ فِي بُرُوجٍ مُّشَيَّدَةٍ ۗ﴾.",
"ربنا اغفر لنا ولوالدينا وللمؤمنين وللمؤمنات انك غفور رحيم .",
"هّوِن عليك فما هي إلا دُنيا .",
"اللهم صلّ وسلم على سيدنا مُحمد .",
"اللهم إملأ قلبي حُبًا لك، وتعلقًا بك، وإقبالًا عليك ،ولا تعلقه بأمر من أمور الدنيا أو بأحدٍ من خلقك .",
"اللهُم أنزل غيث شفائك على أجسادٌ تتألم ..",
"يَارب اِنزَعَ كُلُ ضِيقّ مَن صَدرِي .",
"‏﴿ يَا حَسْرَةً عَلَى الْعِبَادِ ۚ ﴾",
"﴿ لِيَجْزِىَ ٱللَّهُ كُلَّ نَفْسٍۢ مَّا كَسَبَتْ ۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ ﴾.",
"أستغفر الله العظيم وأتوبُ إليه .",
"وَجعّلي مِن جبر الخَواطِر ، نصيب .",
"سيُفرحني الله ، يوماً قريباً جداً .",
"‏﴿ فَوَقاهُمُ اللَّهُ شَرَّ ذلِكَ اليَومِ وَلَقّاهُم نَضرَةً وَسُرورًا ﴾",
"ربي لا تريني  بأمي بأساً يبكيني واجعلني بِها من البارين . .",
"سألتك رباه أن تَهدني ♥️",
"إلا لهو ولعِب",
"‏﴿ فَأَمَّآ إِن كَانَ مِنَ الْمُقَرَّبِينَ۝فَرَوْحٌ وَرَيْحَانٌ وَجَنَّتُ نَعِيم ﴾.",
"أستغفرالله العظيم الذي لا اله الا هو الحي القيوم وأتوب إليه عدد خلقه ورضى نفسه وزنة عرشه ومداد كلماته",
"اللهم لا تؤاخذنا بما فعل السفهاء منّا",
"رباهُ..إن لم تكن أنت فمن لها",
"القرآن شفاء للصدور والأبدان..",
"‏{رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ}",
"الحَمدُ لله على نِعمة الإسلام .",
"{ وَٱلَّذِینَ إِذَا فَعَلُوا۟ فَـٰحِشَةً أَوۡ ظَلَمُوۤا۟ أَنفُسَهُمۡ ذَكَرُوا۟ ٱللَّهَ فَٱسۡتَغۡفَرُوا۟ لِذُنُوبِهِمۡ وَمَن یَغۡفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ وَلَمۡ یُصِرُّوا۟ عَلَىٰ مَا فَعَلُوا۟ وَهُمۡ یَعۡلَمُونَ }",
"سورة الكهف نورٌ مابين الجمعتين .",
"الطُرُقُ لا تُسَدُّ علىٰ من أيقَنَ أنَّ عند اللهِ المَخَارِج .",
"سيَبعَثُ اللهُ مِن آفاقِ رحمَتهِ ‏لُطفًا يُرممُ في جَنْبَيكَ ما هُدِما",
"‏اللهم لا تبتلينا فيما لا نستطيع عليه صبرا.",
"الله أكبر كبيراً الحمدلله كثيراً سبحان الله بكرةً واصيلاً  .",
"لا اله الا انت سبحانك اني كنت من الظالمين",
"سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى",
"اللهم قَلبًا صَالحا لا يَعصيكَ",
"{ أَفَلَا یَتُوبُونَ إِلَى ٱللَّهِ وَیَسۡتَغۡفِرُونَهُۥۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ }",
"الحمدلله",
"- ‏ربِ زدني كرهاً في كل شئ لا يرضيك .",
"‏لن يُحمّلك الله شيئًا لا تقوى عليه.",
"- ‏اللهم اهدِنَا، واهدِ بنا، واجعلْنَا سبَبًا لمنِ اهتدىٰ .",
"‏﴿ فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا ﴾",
"‏﴿اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا﴾",
"{‏إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ}",
"‏{لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا}",
"ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
"لعلّ الله اليوم يُجيبنا كما أجابَ مُوسى عليه السلام: قد أُوتيت سُؤلك يا مُوسى .",
"نستغفرك ربي صمتاً، فرضاً، حزناً و عافية.",
"ملاذ الإنسان أُمه .",
"وافوض أمري إلى الله والله خير الحاكمين والحافظين",
"سَيطيبُ كُل شيء ذاتّ يوم لاتَحزن.",
"‏{فَقُلِ الْحَمْدُ لِلَّهِ}",
"اللهُمّ قوي قَلبي بِك وذكرّني دائمًا بكَ كي لا أتُوه في الدّنيا وأنسَى لمَا خُلقت.",
"اللهُم الجنة لمنْ ذهبت ارواحهم إليك.",
"وَاستغفِرُوا اللهَ إِنَّ اَلله غفورٌ رحيمٌ.",
"اللهم صل على محمد وآل محمد .",
"اللهّم أحسن رحيلي إن حان وقتُه.",
"الله أكبر كبيراً الحمدلله كثيراً سبحان الله بكرةً واصيلاً."
]

co = btn(text ="قصيدة",callback_data = 'c')
com = btn(text ="آية",callback_data = 'ch')
echo = btn(text = "المطور",url = "https://t.me/jj8jjj8")
ne = btn(text = "التالي",callback_data = "n1")
nx = btn(text = "التالي",callback_data = "n2")
@bot.message_handler(commands=['start'])
def start(message):
    maac = types.InlineKeyboardMarkup()
    maac.row_width = 3
    maac.add(co,com)
    maac.add(echo)
    
    bjj = message.chat.id
    bot.send_message(message.chat.id,text=f"""<strong>
Hi <code>{message.from_user.first_name}</code>, 
==============
اهلا بك في بوت القصائد اضغط زر (قصيدة او آية)
==============
</strong>
    """,parse_mode='html',reply_to_message_id=message.message_id, reply_markup=maac)
@bot.callback_query_handler(func=lambda call: True)
def dev(call):
	global aseda
	if call.data == 'c':
		nex = types.InlineKeyboardMarkup()
		nex.add(ne)
		bot.reply_to(call.message,"<strong>يتم العثور الرجاء الانتظار... </strong>",parse_mode="html")
		sleep(1)
		rl = random.randint(1,512)
		url = f"https://t.me/ltmeatj/{rl}"
		bot.send_audio(call.message.chat.id,url,reply_markup=nex)
	
	if call.data == 'n1':
		
		nex = types.InlineKeyboardMarkup()
		nex.add(ne)
		
		sleep(1)
		rl = random.randint(1,512)
		url = f"https://t.me/ltmeatj/{rl}"
		bot.send_audio(call.message.chat.id,url,reply_markup=nex)
	
	
	if call.data == "ch":
		
		next = types.InlineKeyboardMarkup()
		next.add(nx)
		
		mse = random.choice(iea)
		bot.send_message(call.message.chat.id,mse,reply_markup=next)
		
	if call.data == "n2":
		next = types.InlineKeyboardMarkup()
		next.add(nx)
		
		mse = random.choice(iea)
		bot.send_message(call.message.chat.id,mse,reply_markup=next)

bot.infinity_polling()